================================================================================
Properties, without Cabal version
================================================================================

name: pkg-foo
build-type: Simple
version: 1.0

library
  foo: bar

--------------------------------------------------------------------------------

(cabal
  (properties
    (field
      (field_name)
      (field_value))
    (field
      (field_name)
      (field_value))
    (field
      (field_name)
      (field_value)))
  (sections
    (library
      (property_or_conditional_block
        (indent)
        (field
          (field_name)
          (field_value))
        (dedent)))))

================================================================================
Properties, with Cabal version
================================================================================

cabal-version : 3.4
name: pkg-foo
version: 1.1
build-type: Simple
license: BSD

library
    foo: bar

--------------------------------------------------------------------------------

(cabal
  (cabal_version
    (spec_version))
  (properties
    (field
      (field_name)
      (field_value))
    (field
      (field_name)
      (field_value))
    (field
      (field_name)
      (field_value))
    (field
      (field_name)
      (field_value)))
  (sections
    (library
      (property_or_conditional_block
        (indent)
        (field
          (field_name)
          (field_value))
        (dedent)))))

================================================================================
Properties, with comment
================================================================================

-- set the version explicitly
cabal-version : 3.4
name: pkg-foo
-- a comment must be on a line by itself 
build-type: Simple
foo-bar: baz

library
  -- this isn't a valid field
  foo: bar

--------------------------------------------------------------------------------

(cabal
  (comment)
  (cabal_version
    (spec_version))
  (properties
    (field
      (field_name)
      (field_value))
    (comment)
    (field
      (field_name)
      (field_value))
    (field
      (field_name)
      (field_value)))
  (sections
    (library
      (property_or_conditional_block
        (indent)
        (comment)
        (field
          (field_name)
          (field_value))
        (dedent)))))

================================================================================
Properties, with multi-line values
================================================================================

cabal-version : 3.4
foo1: Single line value, on same line
bar1:
    Single line value, on separate line
foo2: Two lines, starting on same line
    and continuing
bar2:
    Two lines, starting separate line
    and continuing
foo3: Three lines, starting on same line
    and continuing
    and continuing
bar3:
    Three lines, starting on separate line
    and continuing
    and continuing

library
    foo: bar

--------------------------------------------------------------------------------

(cabal
  (cabal_version
    (spec_version))
  (properties
    (field
      (field_name)
      (field_value))
    (field
      (field_name)
      (field_value))
    (field
      (field_name)
      (field_value)
      (indent)
      (field_value)
      (dedent))
    (field
      (field_name)
      (field_value)
      (indent)
      (field_value)
      (dedent))
    (field
      (field_name)
      (field_value)
      (indent)
      (field_value)
      (field_value)
      (dedent))
    (field
      (field_name)
      (field_value)
      (indent)
      (field_value)
      (field_value)
      (dedent)))
  (sections
    (library
      (property_or_conditional_block
        (indent)
        (field
          (field_name)
          (field_value))
        (dedent)))))
